Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# ai.context.settings.maximumArchiveSize.description
source: Applies to complete repository ZIP downloads for AI Summary, AI Chat, Knowledge Base project context, CodeFlow, and CodebaseMemory. Processing stops when an archive exceeds this limit.
ar: ينطبق على تنزيلات ZIP الكاملة للمستودع لملخص الذكاء الاصطناعي، دردشة الذكاء الاصطناعي، سياق مشروع قاعدة المعرفة، CodeFlow، و CodebaseMemory. تتوقف المعالجة عندما يتجاوز الأرشيف هذا الحد.
de: Gilt für vollständige Repository-ZIP-Downloads für KI-Zusammenfassung, KI-Chat, Wissensdatenbank-Projektkontext, CodeFlow und CodebaseMemory. Die Verarbeitung wird gestoppt, wenn ein Archiv dieses Limit überschreitet.
es: Se aplica a las descargas ZIP completas del repositorio para Resumen IA, Chat IA, contexto de proyecto de Base de Conocimiento, CodeFlow y CodebaseMemory. El procesamiento se detiene cuando un archivo supera este límite.
fr: S'applique aux téléchargements complets de ZIP de dépôt pour le résumé IA, le chat IA, le contexte de projet de la base de connaissances, CodeFlow et CodebaseMemory. Le traitement s'arrête lorsqu'une archive dépasse cette limite.
id: Berlaku untuk unduhan ZIP repositori lengkap untuk Ringkasan AI, Obrolan AI, konteks proyek Basis Pengetahuan, CodeFlow, dan CodebaseMemory. Pemrosesan berhenti ketika arsip melebihi batas ini.
it: Si applica ai download ZIP completi del repository per Riepilogo IA, Chat IA, contesto progetto Knowledge Base, CodeFlow e CodebaseMemory. L'elaborazione si interrompe quando un archivio supera questo limite.
ja: AIサマリー、AIチャット、ナレッジベースのプロジェクトコンテキスト、CodeFlow、CodebaseMemoryのための完全なリポジトリZIPダウンロードに適用されます。アーカイブがこの制限を超えると処理が停止します。
ko: AI 요약, AI 채팅, 지식 베이스 프로젝트 컨텍스트, CodeFlow 및 CodebaseMemory의 전체 리포지토리 ZIP 다운로드에 적용됩니다. 아카이브가 이 제한을 초과하면 처리가 중단됩니다.
nl: Geldt voor volledige repository-ZIP-downloads voor AI-samenvatting, AI-chat, projectcontext van Knowledge Base, CodeFlow en CodebaseMemory. Verwerking stopt wanneer een archief deze limiet overschrijdt.
pl: Dotyczy pełnych pobrań archiwum ZIP repozytorium dla podsumowania AI, czatu AI, kontekstu projektu bazy wiedzy, CodeFlow i CodebaseMemory. Przetwarzanie zostaje zatrzymane, gdy archiwum przekroczy ten limit.
pt_br: Aplica-se a downloads completos de ZIP do repositório para Resumo de IA, Chat de IA, contexto de projeto da Base de Conhecimento, CodeFlow e CodebaseMemory. O processamento é interrompido quando um arquivo excede este limite.
ru: Применяется к полным загрузкам ZIP репозитория для сводки ИИ, чата ИИ, контекста проекта базы знаний, CodeFlow и CodebaseMemory. Обработка прекращается, если архив превышает этот лимит.
tr: AI Özeti, AI Sohbeti, Bilgi Tabanı proje bağlamı, CodeFlow ve CodebaseMemory için tam depo ZIP indirmelerine uygulanır. Arşiv bu sınırı aştığında işlem durur.
uk: Застосовується до повних завантажень ZIP репозиторію для ШІ-підсумку, ШІ-чату, контексту проєкту бази знань, CodeFlow та CodebaseMemory. Обробка зупиняється, коли архів перевищує це обмеження.
vi: Áp dụng cho các bản tải xuống ZIP đầy đủ của kho cho Tóm tắt AI, Chat AI, ngữ cảnh dự án Cơ sở tri thức, CodeFlow và CodebaseMemory. Quá trình xử lý dừng khi tệp lưu trữ vượt quá giới hạn này.
zh_hans: 影响 AI 摘要、AI 对话、知识库项目上下文、CodeFlow 和 CodebaseMemory 的完整仓库 ZIP 下载；压缩包超过此上限时将停止处理。
zh_hant: 影響 AI 摘要、AI 對話、知識庫專案上下文、CodeFlow 和 CodebaseMemory 的完整倉庫 ZIP 下載；壓縮檔超過此上限時將停止處理。

# ai.context.settings.tier1MaxLines
source: Key Files Line Cap
ar: حد أسطر الملفات الرئيسية
de: Zeilenlimit für Schlüsseldateien
es: Límite de líneas de archivos clave
fr: Limite de lignes des fichiers clés
id: Batas Baris File Kunci
it: Limite righe file chiave
ja: 主要ファイルの行数上限
ko: 핵심 파일 줄 수 제한
nl: Regellimiet sleutelbestanden
pl: Limit linii kluczowych plików
pt_br: Limite de Linhas de Arquivos Chave
ru: Лимит строк ключевых файлов
tr: Anahtar Dosyalar Satır Sınırı
uk: Ліміт рядків ключових файлів
vi: Giới hạn Dòng cho Tệp Chính
zh_hans: 关键文件保留行数
zh_hant: 關鍵檔案保留行數

# ai.context.settings.tier1MaxLinesValueFormat
source: %lld lines
ar: %lld سطر
de: %lld Zeilen
es: %lld líneas
fr: %lld lignes
id: %lld baris
it: %lld righe
ja: %lld行
ko: %lld줄
nl: %lld regels
pl: %lld linii
pt_br: %lld linhas
ru: %lld строк
tr: %lld satır
uk: %lld рядків
vi: %lld dòng
zh_hans: %lld 行
zh_hant: %lld 行

# ai.context.settings.title
source: Code Context
ar: سياق الكود
de: Code-Kontext
es: Contexto de código
fr: Contexte de code
id: Konteks Kode
it: Contesto codice
ja: コードコンテキスト
ko: 코드 컨텍스트
pl: Kontekst kodu
pt_br: Contexto de Código
ru: Контекст кода
tr: Kod Bağlamı
uk: Контекст коду
vi: Ngữ cảnh Mã
zh_hans: 代码上下文
zh_hant: 程式碼上下文

# ai.context.settings.tokenBudget
source: Token Budget
ar: ميزانية الرموز
es: Presupuesto de tokens
fr: Budget de jetons
id: Anggaran Token
it: Budget token
ja: トークン予算
ko: 토큰 예산
pl: Budżet tokenów
pt_br: Orçamento de Tokens
ru: Бюджет токенов
tr: Token Bütçesi
uk: Бюджет токенів
vi: Ngân sách Token
zh_hans: Token 预算
zh_hant: Token 預算

# ai.context.storage.actionFailed
source: Code Context Action Failed
ar: فشل إجراء سياق الكود
de: Code-Kontext-Aktion fehlgeschlagen
es: Error en la acción de contexto de código
fr: Échec de l'action de contexte de code
id: Tindakan Konteks Kode Gagal
it: Azione contesto codice fallita
ja: コードコンテキストアクションに失敗しました
ko: 코드 컨텍스트 작업 실패
nl: Codecontextactie mislukt
pl: Akcja kontekstu kodu nie powiodła się
pt_br: Falha na Ação de Contexto de Código
ru: Действие с контекстом кода не выполнено
tr: Kod Bağlamı Eylemi Başarısız
uk: Дія контексту коду не виконана
vi: Thao tác Ngữ cảnh Mã thất bại
zh_hans: 代码上下文操作失败
zh_hant: 程式碼上下文操作失敗

# ai.context.storage.choose
source: Choose Directory
ar: اختيار مجلد
de: Verzeichnis wählen
es: Elegir directorio
fr: Choisir un dossier
id: Pilih Direktori
it: Scegli cartella
ja: ディレクトリを選択
ko: 디렉토리 선택
nl: Kies map
pl: Wybierz katalog
pt_br: Escolher Diretório
ru: Выбрать папку
tr: Dizin Seç
uk: Вибрати каталог
vi: Chọn Thư mục
zh_hans: 选择目录
zh_hant: 選擇目錄

# ai.context.storage.choosePanelPrompt
source: Choose and Migrate
ar: اختيار ونقل
de: Wählen und migrieren
es: Elegir y migrar
fr: Choisir et migrer
id: Pilih dan Migrasi
it: Scegli e migra
ja: 選択して移行
ko: 선택 및 마이그레이션
nl: Kies en migreer
pl: Wybierz i migruj
pt_br: Escolher e Migrar
ru: Выбрать и перенести
tr: Seç ve Taşı
uk: Вибрати та перенести
vi: Chọn và Di chuyển
zh_hans: 选择并迁移
zh_hant: 選擇並遷移

# ai.context.storage.choosePanelTitle
source: Choose Code Context Output Directory
ar: اختيار مجلد إخراج سياق الكود
de: Code-Kontext-Ausgabeverzeichnis wählen
es: Elegir directorio de salida de contexto de código
fr: Choisir le dossier de sortie du contexte de code
id: Pilih Direktori Output Konteks Kode
it: Scegli cartella output contesto codice
ja: コードコンテキスト出力ディレクトリを選択
ko: 코드 컨텍스트 출력 디렉토리 선택
nl: Kies uitvoermap voor codecontext
pl: Wybierz katalog wyjściowy kontekstu kodu
pt_br: Escolher Diretório de Saída do Contexto de Código
ru: Выберите папку вывода контекста кода
tr: Kod Bağlamı Çıktı Dizinini Seç
uk: Виберіть каталог виведення контексту коду
vi: Chọn Thư mục Đầu ra Ngữ cảnh Mã
zh_hans: 选择 代码上下文输出目录
zh_hant: 選擇程式碼上下文輸出目錄

# ai.context.storage.clearAll
source: Clear All
ar: مسح الكل
de: Alle löschen
es: Limpiar todo
fr: Tout effacer
id: Hapus Semua
it: Cancella tutto
ja: すべてクリア
ko: 모두 지우기
nl: Alles wissen
pl: Wyczyść wszystko
pt_br: Limpar Tudo
ru: Очистить всё
tr: Tümünü Temizle
uk: Очистити все
vi: Xóa Tất cả
zh_hans: 一键清除
zh_hant: 一鍵清除

# ai.context.storage.empty
source: No Code Contexs in current directory yet.
ar: لا توجد سياقات كود في المجلد الحالي بعد.
de: Noch keine Code-Kontexte im aktuellen Verzeichnis.
es: Aún no hay contextos de código en el directorio actual.
fr: Aucun contexte de code dans le dossier actuel pour le moment.
id: Belum ada Konteks Kode di direktori saat ini.
it: Nessun contesto codice nella cartella corrente.
ja: 現在のディレクトリにコードコンテキストはまだありません。
ko: 현재 디렉토리에 코드 컨텍스트가 없습니다.
nl: Nog geen codecontexten in huidige map.
pl: Brak kontekstów kodu w bieżącym katalogu.
pt_br: Nenhum Contexto de Código no diretório atual ainda.
ru: В текущей папке ещё нет контекстов кода.
tr: Geçerli dizinde henüz Kod Bağlamı yok.
uk: У поточному каталозі ще немає контекстів коду.
vi: Chưa có Ngữ cảnh Mã nào trong thư mục hiện tại.
zh_hans: 当前目录还没有 代码上下文。
zh_hant: 目前目錄中還沒有程式碼上下文。

# ai.context.storage.outputDirectory
source: Context Output Directory
ar: مجلد إخراج السياق
de: Kontext-Ausgabeverzeichnis
es: Directorio de salida de contexto
fr: Dossier de sortie du contexte
id: Direktori Output Konteks
it: Cartella output contesto
ja: コンテキスト出力ディレクトリ
ko: 컨텍스트 출력 디렉토리
nl: Uitvoermap context
pl: Katalog wyjściowy kontekstu
pt_br: Diretório de Saída do Contexto
ru: Папка вывода контекста
tr: Bağlam Çıktı Dizini
uk: Каталог виведення контексту
vi: Thư mục Đầu ra Ngữ cảnh
zh_hans: 代码上下文输出目录
zh_hant: 上下文輸出目錄

# ai.context.storage.resetHelp
source: Reset to default App Container directory
ar: إعادة التعيين إلى مجلد حاوية التطبيق الافتراضي
de: Auf Standard-App-Container-Verzeichnis zurücksetzen
es: Restablecer al directorio predeterminado del contenedor de la app
fr: Réinitialiser au dossier conteneur de l'application par défaut
id: Atur ulang ke direktori Kontainer Aplikasi default
it: Reimposta alla cartella predefinita del contenitore app
ja: デフォルトのアプリコンテナディレクトリにリセット
ko: 기본 앱 컨테이너 디렉토리로 재설정
nl: Terugzetten naar standaard app-containermap
pl: Przywróć domyślny katalog kontenera aplikacji
pt_br: Redefinir para o diretório padrão do Contêiner do App
ru: Сбросить на папку контейнера приложения по умолчанию
tr: Varsayılan Uygulama Kapsayıcı dizinine sıfırla
uk: Скинути до типового каталогу контейнера програми
vi: Đặt lại về thư mục Vùng chứa Ứng dụng mặc định
zh_hans: 迁移到 App Container 默认目录
zh_hant: 重設為 App Container 預設目錄

# ai.context.storage.revealHelp
source: Reveal in Finder
ar: إظهار في Finder
de: Im Finder anzeigen
es: Mostrar en Finder
fr: Révéler dans le Finder
id: Tampilkan di Finder
it: Mostra nel Finder
ja: Finderで表示
ko: Finder에 표시
nl: Toon in Finder
pl: Pokaż w Finderze
pt_br: Revelar no Finder
ru: Показать в Finder
tr: Finder'da Göster
uk: Показати у Finder
vi: Hiện trong Finder
zh_hans: 在 Finder 中显示
zh_hant: 在 Finder 中顯示

# ai.context.storage.section
source: Code Context
ar: سياق الكود
de: Code-Kontext
es: Contexto de código
fr: Contexte de code
id: Konteks Kode
it: Contesto codice
ja: コードコンテキスト
ko: 코드 컨텍스트
pl: Kontekst kodu
pt_br: Contexto de Código
ru: Контекст кода
tr: Kod Bağlamı
uk: Контекст коду
vi: Ngữ cảnh Mã
zh_hans: 代码上下文
zh_hant: 程式碼上下文

# ai.context.storage.statBytes
source: Size
ar: الحجم
de: Größe
es: Tamaño
fr: Taille
id: Ukuran
it: Dimensione
ja: サイズ
ko: 크기
nl: Grootte
pl: Rozmiar
pt_br: Tamanho
ru: Размер
tr: Boyut
uk: Розмір
vi: Kích thước
zh_hans: 占用
zh_hant: 佔用

# ai.context.storage.statGenerations
source: Generations
ar: مرات التوليد
de: Generationen
es: Generaciones
fr: Générations
id: Generasi
it: Generazioni
ja: 生成回数
ko: 생성 횟수
nl: Generaties
pl: Generacje
pt_br: Gerações
ru: Созданий
tr: Oluşturma Sayısı
uk: Покоління
vi: Số lần tạo
zh_hans: 累计生成
zh_hant: 累計產生

# ai.context.storage.statGenerationsFormat
source: %d times
ar: %d مرة
de: %d Mal
es: %d veces
fr: %d fois
id: %d kali
it: %d volte
ja: %d回
ko: %d회
nl: %d keer
pl: %d razy
pt_br: %d vezes
ru: %d раз
tr: %d kez
uk: %d разів
vi: %d lần
zh_hans: %d 次
zh_hant: %d 次

# ai.context.storage.statLast
source: Last Generated
ar: آخر توليد
de: Zuletzt generiert
es: Última generación
fr: Dernière génération
id: Terakhir Dihasilkan
it: Ultima generazione
ja: 最終生成
ko: 마지막 생성
nl: Laatst gegenereerd
pl: Ostatnio wygenerowane
pt_br: Última Geração
ru: Последнее создание
tr: Son Oluşturma
uk: Останнє створення
vi: Lần tạo gần nhất
zh_hans: 最后生成
zh_hant: 最後產生

# ai.context.storage.statRepos
source: Repos
ar: المستودعات
es: Repositorios
fr: Dépôts
id: Repositori
it: Repository
ja: リポジトリ数
ko: 리포지토리
pl: Repozytoria
pt_br: Repositórios
ru: Репозитории
tr: Depolar
uk: Репозиторії
vi: Kho
zh_hans: 项目
zh_hant: 專案

# ai.context.storage.subtitle
source: Switching directories migrates existing context.xml and metadata.json. Shared source ZIPs remain in the app container.
ar: تبديل المجلدات ينقل ملفات context.xml و metadata.json الموجودة. تبقى ملفات ZIP المصدر المشتركة في حاوية التطبيق.
de: Das Wechseln von Verzeichnissen migriert vorhandene context.xml und metadata.json. Gemeinsam genutzte Quell-ZIPs bleiben im App-Container.
es: Cambiar de directorio migra los context.xml y metadata.json existentes. Los ZIP de origen compartidos permanecen en el contenedor de la app.
fr: Changer de dossier migre les context.xml et metadata.json existants. Les ZIP sources partagés restent dans le conteneur de l'application.
id: Mengganti direktori akan memigrasi context.xml dan metadata.json yang ada. ZIP sumber bersama tetap berada di kontainer aplikasi.
it: Cambiare cartella migra i file context.xml e metadata.json esistenti. Gli ZIP sorgente condivisi rimangono nel contenitore dell'app.
ja: ディレクトリを切り替えると、既存のcontext.xmlとmetadata.jsonが移行されます。共有ソースZIPはアプリコンテナに残ります。
ko: 디렉토리를 전환하면 기존 context.xml과 metadata.json이 마이그레이션됩니다. 공유 소스 ZIP은 앱 컨테이너에 남아 있습니다.
nl: Het wisselen van mappen migreert bestaande context.xml en metadata.json. Gedeelde bron-ZIP's blijven in de app-container.
pl: Zmiana katalogów migruje istniejące pliki context.xml i metadata.json. Współdzielone archiwa ZIP źródła pozostają w kontenerze aplikacji.
pt_br: Alternar diretórios migra context.xml e metadata.json existentes. ZIPs de origem compartilhados permanecem no contêiner do app.
ru: Переключение папок переносит существующие context.xml и metadata.json. Общие ZIP-архивы исходного кода остаются в контейнере приложения.
tr: Dizin değiştirmek mevcut context.xml ve metadata.json dosyalarını taşır. Paylaşılan kaynak ZIP'leri uygulama kapsayıcısında kalır.
uk: Перемикання каталогів переносить наявні context.xml та metadata.json. Спільні ZIP-файли вихідного коду залишаються в контейнері програми.
vi: Chuyển đổi thư mục sẽ di chuyển context.xml và metadata.json hiện có. Các tệp ZIP nguồn dùng chung vẫn nằm trong vùng chứa ứng dụng.
zh_hans: 切换目录时会迁移现有 context.xml 与 metadata.json；共享源码 ZIP 仍保存在应用容器。
zh_hant: 切換目錄時會遷移現有的 context.xml 與 metadata.json；共享原始碼 ZIP 仍保存在應用程式容器。

# ai.embedding.error.authenticationRejected
source: The embedding provider rejected the credential. Update the API key in AI Settings.
ar: رفض مزود التضمين بيانات الاعتماد. قم بتحديث مفتاح API في إعدادات الذكاء الاصطناعي.
de: Der Embedding-Anbieter hat die Anmeldedaten abgelehnt. Aktualisieren Sie den API-Schlüssel in den KI-Einstellungen.
es: El proveedor de embeddings rechazó la credencial. Actualiza la clave API en Ajustes de IA.
fr: Le fournisseur d'embedding a rejeté les identifiants. Mettez à jour la clé API dans les réglages IA.
id: Penyedia embedding menolak kredensial. Perbarui kunci API di Pengaturan AI.
it: Il provider di embedding ha rifiutato la credenziale. Aggiorna la chiave API in Impostazioni IA.
ja: 埋め込みプロバイダーが認証情報を拒否しました。AI設定でAPIキーを更新してください。
ko: 임베딩 제공자가 자격 증명을 거부했습니다. AI 설정에서 API 키를 업데이트하세요.
nl: De embeddingprovider heeft de inloggegevens geweigerd. Werk de API-sleutel bij in AI-instellingen.
pl: Dostawca osadzania odrzucił poświadczenie. Zaktualizuj klucz API w ustawieniach AI.
pt_br: O provedor de embedding rejeitou a credencial. Atualize a chave da API em Configurações de IA.
ru: Провайдер эмбеддингов отклонил учётные данные. Обновите API-ключ в настройках ИИ.
tr: Gömme sağlayıcı kimlik bilgisini reddetti. AI Ayarları'nda API anahtarını güncelleyin.
uk: Постачальник вбудовувань відхилив облікові дані. Оновіть ключ API в налаштуваннях ШІ.
vi: Nhà cung cấp nhúng đã từ chối thông tin xác thực. Cập nhật khóa API trong Cài đặt AI.
zh_hans: 向量化服务商拒绝了当前凭据，请在 AI 设置中更新 API Key。
zh_hant: 向量化服務商拒絕了目前憑證，請在 AI 設定中更新 API Key。

# ai.embedding.error.emptyResponse
source: The embedding model returned no usable vectors. Check the selected model and try again.
ar: أعاد نموذج التضمين متجهات غير قابلة للاستخدام. تحقق من النموذج المحدد وحاول مرة أخرى.
de: Das Embedding-Modell hat keine brauchbaren Vektoren zurückgegeben. Überprüfen Sie das ausgewählte Modell und versuchen Sie es erneut.
es: El modelo de embeddings no devolvió vectores utilizables. Revisa el modelo seleccionado e inténtalo de nuevo.
fr: Le modèle d'embedding n'a renvoyé aucun vecteur utilisable. Vérifiez le modèle sélectionné et réessayez.
id: Model embedding tidak mengembalikan vektor yang dapat digunakan. Periksa model yang dipilih dan coba lagi.
it: Il modello di embedding non ha restituito vettori utilizzabili. Controlla il modello selezionato e riprova.
ja: 埋め込みモデルが使用可能なベクトルを返しませんでした。選択したモデルを確認して再試行してください。
ko: 임베딩 모델이 사용 가능한 벡터를 반환하지 않았습니다. 선택한 모델을 확인하고 다시 시도하세요.
nl: Het embeddingmodel heeft geen bruikbare vectoren geretourneerd. Controleer het geselecteerde model en probeer het opnieuw.
pl: Model osadzania nie zwrócił użytecznych wektorów. Sprawdź wybrany model i spróbuj ponownie.
pt_br: O modelo de embedding não retornou vetores utilizáveis. Verifique o modelo selecionado e tente novamente.
ru: Модель эмбеддингов не вернула пригодных векторов. Проверьте выбранную модель и повторите попытку.
tr: Gömme modeli kullanılabilir vektör döndürmedi. Seçilen modeli kontrol edin ve tekrar deneyin.
uk: Модель вбудовувань не повернула придатних векторів. Перевірте вибрану модель та спробуйте знову.
vi: Mô hình nhúng không trả về vector nào có thể sử dụng. Kiểm tra mô hình đã chọn và thử lại.
zh_hans: 向量化模型没有返回可用向量，请检查所选模型后重试。
zh_hant: 向量化模型沒有回傳可用向量，請檢查所選模型後重試。

# ai.embedding.error.incompatibleModelFormat
source: The selected model %@ is not an embedding model. Choose an embedding-capable model in AI Settings.
ar: النموذج المحدد %@ ليس نموذج تضمين. اختر نموذجًا قادرًا على التضمين في إعدادات الذكاء الاصطناعي.
de: Das ausgewählte Modell %@ ist kein Embedding-Modell. Wählen Sie ein embedding-fähiges Modell in den KI-Einstellungen.
es: El modelo seleccionado %@ no es un modelo de embeddings. Elige un modelo compatible con embeddings en Ajustes de IA.
fr: Le modèle sélectionné %@ n'est pas un modèle d'embedding. Choisissez un modèle compatible avec l'embedding dans les réglages IA.
id: Model yang dipilih %@ bukan model embedding. Pilih model yang mendukung embedding di Pengaturan AI.
it: Il modello selezionato %@ non è un modello di embedding. Scegli un modello in grado di fare embedding in Impostazioni IA.
ja: 選択したモデル%@は埋め込みモデルではありません。AI設定で埋め込み対応モデルを選択してください。
ko: 선택한 모델 %@은(는) 임베딩 모델이 아닙니다. AI 설정에서 임베딩 가능한 모델을 선택하세요.
nl: Het geselecteerde model %@ is geen embeddingmodel. Kies een model dat embeddings ondersteunt in AI-instellingen.
pl: Wybrany model %@ nie jest modelem osadzania. Wybierz model obsługujący osadzanie w ustawieniach AI.
pt_br: O modelo selecionado %@ não é um modelo de embedding. Escolha um modelo compatível com embeddings em Configurações de IA.
ru: Выбранная модель %@ не является моделью эмбеддингов. Выберите модель, поддерживающую эмбеддинги, в настройках ИИ.
tr: Seçilen model %@ bir gömme modeli değil. AI Ayarları'nda gömme yapabilen bir model seçin.
uk: Вибрана модель %@ не є моделлю вбудовувань. Виберіть модель, здатну до вбудовувань, у налаштуваннях ШІ.
vi: Mô hình %@ đã chọn không phải là mô hình nhúng. Chọn mô hình hỗ trợ nhúng trong Cài đặt AI.
zh_hans: 当前选择的模型 %@ 不是向量化模型，请在 AI 设置中选择支持 Embedding 的模型。
zh_hant: 目前選擇的模型 %@ 不是向量化模型，請在 AI 設定中選擇支援 Embedding 的模型。

# ai.embedding.error.invalidResponse
source: The embedding provider returned an unsupported response. Check that the selected model supports embeddings.
ar: أعاد مزود التضمين استجابة غير مدعومة. تحقق من أن النموذج المحدد يدعم التضمين.
de: Der Embedding-Anbieter hat eine nicht unterstützte Antwort zurückgegeben. Überprüfen Sie, ob das ausgewählte Modell Embeddings unterstützt.
es: El proveedor de embeddings devolvió una respuesta no compatible. Verifica que el modelo seleccionado admita embeddings.
fr: Le fournisseur d'embedding a renvoyé une réponse non prise en charge. Vérifiez que le modèle sélectionné prend en charge les embeddings.
id: Penyedia embedding mengembalikan respons yang tidak didukung. Pastikan model yang dipilih mendukung embedding.
it: Il provider di embedding ha restituito una risposta non supportata. Verifica che il modello selezionato supporti gli embedding.
ja: 埋め込みプロバイダーがサポートされていない応答を返しました。選択したモデルが埋め込みをサポートしているか確認してください。
ko: 임베딩 제공자가 지원되지 않는 응답을 반환했습니다. 선택한 모델이 임베딩을 지원하는지 확인하세요.
nl: De embeddingprovider heeft een niet-ondersteund antwoord geretourneerd. Controleer of het geselecteerde model embeddings ondersteunt.
pl: Dostawca osadzania zwrócił nieobsługiwaną odpowiedź. Sprawdź, czy wybrany model obsługuje osadzanie.
pt_br: O provedor de embedding retornou uma resposta não suportada. Verifique se o modelo selecionado suporta embeddings.
ru: Провайдер эмбеддингов вернул неподдерживаемый ответ. Убедитесь, что выбранная модель поддерживает эмбеддинги.
tr: Gömme sağlayıcı desteklenmeyen bir yanıt döndürdü. Seçilen modelin gömme desteklediğini kontrol edin.
uk: Постачальник вбудовувань повернув непідтримувану відповідь. Перевірте, чи вибрана модель підтримує вбудовування.
vi: Nhà cung cấp nhúng trả về phản hồi không được hỗ trợ. Kiểm tra xem mô hình đã chọn có hỗ trợ nhúng không.
zh_hans: 向量化服务返回了无法识别的响应，请确认所选模型支持 Embedding。
zh_hant: 向量化服務回傳了無法辨識的回應，請確認所選模型支援 Embedding。

# ai.embedding.error.missingAPIKey
source: The embedding provider has no API key. Add one in AI Settings.
ar: لا يملك مزود التضمين مفتاح API. أضف واحدًا في إعدادات الذكاء الاصطناعي.
de: Der Embedding-Anbieter hat keinen API-Schlüssel. Fügen Sie einen in den KI-Einstellungen hinzu.
es: El proveedor de embeddings no tiene clave API. Añade una en Ajustes de IA.
fr: Le fournisseur d'embedding n'a pas de clé API. Ajoutez-en une dans les réglages IA.
id: Penyedia embedding tidak memiliki kunci API. Tambahkan satu di Pengaturan AI.
it: Il provider di embedding non ha una chiave API. Aggiungine una in Impostazioni IA.
ja: 埋め込みプロバイダーにAPIキーがありません。AI設定で追加してください。
ko: 임베딩 제공자에 API 키가 없습니다. AI 설정에서 추가하세요.
nl: De embeddingprovider heeft geen API-sleutel. Voeg er een toe in AI-instellingen.
pl: Dostawca osadzania nie ma klucza API. Dodaj go w ustawieniach AI.
pt_br: O provedor de embedding não tem chave de API. Adicione uma em Configurações de IA.
ru: У провайдера эмбеддингов нет API-ключа. Добавьте его в настройках ИИ.
tr: Gömme sağlayıcının API anahtarı yok. AI Ayarları'na bir tane ekleyin.
uk: У постачальника вбудовувань немає ключа API. Додайте його в налаштуваннях ШІ.
vi: Nhà cung cấp nhúng không có khóa API. Thêm khóa API trong Cài đặt AI.
zh_hans: 向量化服务商尚未配置 API Key，请先在 AI 设置中补充。
zh_hant: 向量化服務商尚未設定 API Key，請先在 AI 設定中補充。

# ai.embedding.error.missingModel
source: No embedding model is configured. Choose one in AI Settings.
ar: لم يتم تكوين نموذج تضمين. اختر واحدًا في إعدادات الذكاء الاصطناعي.
de: Es ist kein Embedding-Modell konfiguriert. Wählen Sie eines in den KI-Einstellungen.
es: No hay ningún modelo de embeddings configurado. Elige uno en Ajustes de IA.
fr: Aucun modèle d'embedding configuré. Choisissez-en un dans les réglages IA.
id: Tidak ada model embedding yang dikonfigurasi. Pilih satu di Pengaturan AI.
it: Nessun modello di embedding configurato. Scegline uno in Impostazioni IA.
ja: 埋め込みモデルが設定されていません。AI設定で選択してください。
ko: 임베딩 모델이 구성되지 않았습니다. AI 설정에서 선택하세요.
nl: Er is geen embeddingmodel geconfigureerd. Kies er een in AI-instellingen.
pl: Nie skonfigurowano modelu osadzania. Wybierz go w ustawieniach AI.
pt_br: Nenhum modelo de embedding configurado. Escolha um em Configurações de IA.
ru: Не настроена модель эмбеддингов. Выберите её в настройках ИИ.
tr: Hiçbir gömme modeli yapılandırılmamış. AI Ayarları'nda bir tane seçin.
uk: Не налаштовано жодної моделі вбудовувань. Виберіть одну в налаштуваннях ШІ.
vi: Chưa cấu hình mô hình nhúng. Chọn một mô hình trong Cài đặt AI.
zh_hans: 尚未配置向量化模型，请先在 AI 设置中选择。
zh_hant: 尚未設定向量化模型，請先在 AI 設定中選擇。
